"""
Lesson 14
18.01.2025

Python: Функции Ч1. Нейминг. Философия. Типы аргументов. Урок: 14

- DRY - Don't Repeat Yourself (Не повторяйся)
- SRP - Single Responsibility Principle (Принцип единственной ответственности)
- Функия - возможность вынести логику в целостную независимую сущность. Которая может что-то принять на вход, и что то отдать на выходе

Правила нейминга для функций в PYTHON

1. snake_case для названий
2. наличие глагола в названии
3. максимально точное описане действия в названии
4. Не используем служебные имена
5. Можно использовть 3-4 слова 

Нельзя начинать с цифр
Нельзя использовать дефисы
Нельзя использовать пробелы
Нельзя использовать зарезервированные слова Python

Известные цитаты про функции:

"Функции должны делать что-то одно. Они должны делать это хорошо. Они должны делать только это."

Роберт Мартин (Uncle Bob)

"Хорошая функция похожа на хороший абзац: она посвящена одной теме и содержит детали, поддерживающие эту тему."

Стив Макконнелл

"Функциональное программирование - это программирование без побочных эффектов. Оно делает поведение программы более предсказуемым."

Джон Хьюз

"Если функция делает больше, чем говорит её название - у вас проблемы."

Мартин Фаулер

"Функции - это рецепты. Параметры - ингредиенты. Результат - готовое блюдо."
Эрик Эллиотт
"""

